#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.suffix: Refreshing state... [id=sv8Vpanx]
module.eks.data.aws_iam_policy_document.cluster_assume_role_policy: Reading...
data.aws_availability_zones.available: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_policy_document.cluster_elb_sl_role_creation[0]: Reading...
module.eks.module.fargate.data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_iam_policy_document.cluster_deny_log_group[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-070b98f5fd0399a4a]
module.eks.data.aws_iam_policy_document.cluster_assume_role_policy: Read complete after 0s [id=2764486067]
module.eks.data.aws_iam_policy_document.cluster_elb_sl_role_creation[0]: Read complete after 0s [id=3709839417]
module.eks.data.aws_iam_policy_document.cluster_deny_log_group[0]: Read complete after 0s [id=2675893060]
module.eks.module.fargate.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::354429752491:policy/sonikro-eks-sv8Vpanx-elb-sl-role-creation20220521195346012500000001]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=sonikro-eks-sv8Vpanx20220521195346013500000002]
module.eks.data.aws_iam_policy_document.workers_assume_role_policy: Reading...
module.eks.aws_iam_policy.cluster_deny_log_group[0]: Refreshing state... [id=arn:aws:iam::354429752491:policy/sonikro-eks-sv8Vpanx-deny-log-group20220521195346016200000003]
module.eks.data.aws_iam_policy_document.workers_assume_role_policy: Read complete after 0s [id=3778018924]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0256f2195f8944a4e]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=354429752491]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-08c0c390060a1b8ea]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0b0ada8f723ca4f74]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-09aebbbec0acbc41f]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-0c25a245c1a045867]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0e408d7e0499d1ae6]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-05127e793f3efd845]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0bf0d4c722c8eea3d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-055cab4552d0a281f]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0c0c4a91eea068549]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0a041d15ba6532102]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09a1ea0bae1f7ed47]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c9b3cd1193c76936]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f979f2d81bf0219b]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-0aae1d40643d93ea7]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-2836979720]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-3662561906]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-3565580873]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-3802524205]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-1889620729]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-1634603859]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f8814aeee26a60fd]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0efc8e39e406b135d]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-051159a56ce63d8f3]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0b0ada8f723ca4f741080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04d3d7eb5c6aaba99]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02919b351eebd68f7]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-021c42949960a5428]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-043828e05699b9aba]
module.eks.data.aws_ami.eks_worker[0]: Reading...
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0e408d7e0499d1ae61080289494]
module.eks.data.aws_ami.eks_worker[0]: Read complete after 1s [id=ami-0ead150522a5a30e1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.aws_iam_role.cluster[0] has changed
  ~ resource "aws_iam_role" "cluster" {
        id                    = "sonikro-eks-sv8Vpanx20220521195346013500000002"
        name                  = "sonikro-eks-sv8Vpanx20220521195346013500000002"
      + tags                  = {}
      + tags_all              = {}
        # (9 unchanged attributes hidden)

      + inline_policy {}
    }

  # module.eks.aws_security_group.cluster[0] has changed
  ~ resource "aws_security_group" "cluster" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow cluster egress access to the Internet."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0c0c4a91eea068549"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow pods to communicate with the EKS cluster API."
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-09aebbbec0acbc41f",
                ]
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "sonikro-eks-sv8Vpanx20220521195357527700000004"
        tags                   = {
            "Name" = "sonikro-eks-sv8Vpanx-eks_cluster_sg"
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.workers[0] has changed
  ~ resource "aws_security_group" "workers" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow nodes all egress to the Internet."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-09aebbbec0acbc41f"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow node to communicate with each other."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0c0c4a91eea068549",
                ]
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow workers pods to receive communication from the cluster control plane."
              + from_port        = 1025
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0c0c4a91eea068549",
                ]
              + self             = false
              + to_port          = 65535
            },
        ]
        name                   = "sonikro-eks-sv8Vpanx20220521195357528600000005"
        tags                   = {
            "Name"                                       = "sonikro-eks-sv8Vpanx-eks_worker_sg"
            "kubernetes.io/cluster/sonikro-eks-sv8Vpanx" = "owned"
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] has changed
  ~ resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      + cidr_blocks              = []
        id                       = "sgrule-3802524205"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-09ffb7747929d979b"
        id                   = "eipalloc-0256f2195f8944a4e"
      + network_interface    = "eni-040714ad3db279048"
      + private_dns          = "ip-10-0-4-117.ec2.internal"
      + private_ip           = "10.0.4.117"
        tags                 = {
            "Name"                                       = "sonikro-k8s-vpc-us-east-1a"
            "kubernetes.io/cluster/sonikro-eks-sv8Vpanx" = "shared"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0e408d7e0499d1ae6"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-04d3d7eb5c6aaba99"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"                                       = "sonikro-k8s-vpc-private"
            "kubernetes.io/cluster/sonikro-eks-sv8Vpanx" = "shared"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0b0ada8f723ca4f74"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0f979f2d81bf0219b"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"                                       = "sonikro-k8s-vpc-public"
            "kubernetes.io/cluster/sonikro-eks-sv8Vpanx" = "shared"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

�────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster" {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster" {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = (known after apply)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be created
  + resource "aws_autoscaling_group" "workers" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + capacity_rebalance        = false
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "sonikro-eks-sv8Vpanx-worker-group-1"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = [
          + "subnet-05127e793f3efd845",
          + "subnet-055cab4552d0a281f",
          + "subnet-0bf0d4c722c8eea3d",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "sonikro-eks-sv8Vpanx-worker-group-1-eks_asg"
        }
      + tag {
          + key                 = "k8s.io/cluster/sonikro-eks-sv8Vpanx"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/sonikro-eks-sv8Vpanx"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.eks.aws_autoscaling_group.workers[1] will be created
  + resource "aws_autoscaling_group" "workers" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + capacity_rebalance        = false
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + max_instance_lifetime     = 0
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = "sonikro-eks-sv8Vpanx-worker-group-2"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + suspended_processes       = [
          + "AZRebalance",
        ]
      + termination_policies      = []
      + vpc_zone_identifier       = [
          + "subnet-05127e793f3efd845",
          + "subnet-055cab4552d0a281f",
          + "subnet-0bf0d4c722c8eea3d",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "sonikro-eks-sv8Vpanx-worker-group-2-eks_asg"
        }
      + tag {
          + key                 = "k8s.io/cluster/sonikro-eks-sv8Vpanx"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/sonikro-eks-sv8Vpanx"
          + propagate_at_launch = true
          + value               = "owned"
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "sonikro-eks-sv8Vpanx"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = "1.20"

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
          + update = "60m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "sg-0c0c4a91eea068549",
            ]
          + subnet_ids                = [
              + "subnet-05127e793f3efd845",
              + "subnet-055cab4552d0a281f",
              + "subnet-0bf0d4c722c8eea3d",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_instance_profile.workers[0] will be created
  + resource "aws_iam_instance_profile" "workers" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "sonikro-eks-sv8Vpanx"
      + path        = "/"
      + role        = (known after apply)
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_instance_profile.workers[1] will be created
  + resource "aws_iam_instance_profile" "workers" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "sonikro-eks-sv8Vpanx"
      + path        = "/"
      + role        = (known after apply)
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks.aws_iam_role.cluster[0] is tainted, so must be replaced
+/- resource "aws_iam_role" "cluster" {
      ~ arn                   = "arn:aws:iam::354429752491:role/sonikro-eks-sv8Vpanx20220521195346013500000002" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "eks.amazonaws.com"
                        }
                        Sid       = "EKSClusterAssumeRole"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2022-05-21T19:53:46Z" -> (known after apply)
      ~ id                    = "sonikro-eks-sv8Vpanx20220521195346013500000002" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "sonikro-eks-sv8Vpanx20220521195346013500000002" -> (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAVFBNI2SV5QL4BEYRY" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.workers[0] will be created
  + resource "aws_iam_role" "workers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "sonikro-eks-sv8Vpanx"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_deny_log_group" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::354429752491:policy/sonikro-eks-sv8Vpanx-deny-log-group20220521195346016200000003"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::354429752491:policy/sonikro-eks-sv8Vpanx-elb-sl-role-creation20220521195346012500000001"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be created
  + resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.aws_launch_configuration.workers[0] will be created
  + resource "aws_launch_configuration" "workers" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = false
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-0ead150522a5a30e1"
      + instance_type               = "t2.small"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "sonikro-eks-sv8Vpanx-worker-group-1"
      + security_groups             = [
          + "sg-08c0c390060a1b8ea",
          + "sg-09aebbbec0acbc41f",
        ]
      + user_data_base64            = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "optional"
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = false
          + iops                  = 0
          + throughput            = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp2"
        }
    }

  # module.eks.aws_launch_configuration.workers[1] will be created
  + resource "aws_launch_configuration" "workers" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = false
      + enable_monitoring           = true
      + iam_instance_profile        = (known after apply)
      + id                          = (known after apply)
      + image_id                    = "ami-0ead150522a5a30e1"
      + instance_type               = "t2.medium"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "sonikro-eks-sv8Vpanx-worker-group-2"
      + security_groups             = [
          + "sg-09aebbbec0acbc41f",
          + "sg-0aae1d40643d93ea7",
        ]
      + user_data_base64            = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "optional"
        }

      + root_block_device {
          + delete_on_termination = true
          + encrypted             = false
          + iops                  = 0
          + throughput            = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp2"
        }
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_sonikro-eks-sv8Vpanx"
      + id                   = (known after apply)
    }

Plan: 19 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + cluster_endpoint    = (known after apply)
  + cluster_id          = (known after apply)
  + config_map_aws_auth = [
      + {
          + binary_data = null
          + data        = (known after apply)
          + id          = (known after apply)
          + metadata    = [
              + {
                  + annotations      = null
                  + generate_name    = null
                  + generation       = (known after apply)
                  + labels           = {
                      + "app.kubernetes.io/managed-by" = "Terraform"
                      + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
                    }
                  + name             = "aws-auth"
                  + namespace        = "kube-system"
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                },
            ]
        },
    ]
  + kubectl_config      = (known after apply)

�────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sonikro, Action: `pull_request`*